Repository: quocminh28102/vehicles_warranty_manager
Catalog: lib/l10n/app_*.arb
Languages: vi

# appTitle
source: Vehicles Warranty Manager
vi: Quản lý Bảo hành Xe

# navDashboard
source: Dashboard
vi: Tổng quan

# navWarranties
source: Warranty Requests
vi: Yêu cầu bảo hành

# navReports
source: Reports
vi: Báo cáo

# dashboardTitle
source: Overview
vi: Tổng quan

# warrantiesTitle
source: Warranty Requests
vi: Yêu cầu bảo hành

# reportsTitle
source: Reports
vi: Báo cáo

source: Quick actions
vi: Thao tác nhanh

source: Attach file
vi: Đính kèm file

# summaryRequests
source: Warranty requests
vi: Yêu cầu bảo hành

# summaryPending
source: Pending requests
vi: Đang chờ duyệt

# summaryInProgress
source: In progress
vi: Đang xử lý

# loginTitle
source: Sign in
vi: Đăng nhập

# registerTitle
source: Create account
vi: Tạo tài khoản

source: Display name
vi: Tên hiển thị

source: Password
vi: Mật khẩu

source: Sign in
vi: Đăng nhập

source: Create account
vi: Tạo tài khoản

# noAccount
source: No account? Register
vi: Chưa có tài khoản? Đăng ký

# haveAccount
source: Already have an account? Sign in
vi: Đã có tài khoản? Đăng nhập

source: Sign out
vi: Đăng xuất

source: VIN
vi: Số VIN

source: Model
vi: Dòng xe

source: Save
vi: Lưu

source: Cancel
vi: Hủy

source: Issue
vi: Lỗi phát sinh

source: Description
vi: Mô tả

# upgradeCategory
source: Upgrade item
vi: Hạng mục nâng cấp

# upgradeCategoryHint
source: e.g. Camera 360, Harman Kardon audio, Electric running board
vi: VD: Camera 360, Âm thanh Harman Kardon, Bậc bước điện

source: Upgrade date
vi: Ngày nâng cấp

source: Request warranty
vi: Yêu cầu bảo hành

# addRequest
source: New request
vi: Tạo yêu cầu mới

# attachmentLinks
source: Attachment links (Google Drive)
vi: Link đính kèm (Google Drive)

source: Requester
vi: Người yêu cầu

# viewOnly
source: You don't have permission to update status.
vi: Bạn không có quyền cập nhật trạng thái.

source: Pending
vi: Chờ duyệt

source: Approved
vi: Đã duyệt

source: Rejected
vi: Từ chối

source: In progress
vi: Đang xử lý

source: Done
vi: Hoàn tất

# daysLeft
source: {days} days left
vi: Còn {days} ngày

# daysLeftZero
source: Expires today
vi: Hết hạn hôm nay

# daysExpired
source: Expired {days} days
vi: Đã hết hạn {days} ngày

source: Change
vi: Đổi

# emptyState
source: No data yet. Start by creating a record.
vi: Chưa có dữ liệu. Hãy tạo bản ghi mới.

# comingSoon
source: This section is ready for integration with Firebase data.
vi: Phần này đã sẵn sàng để kết nối dữ liệu Firebase.

# navCatalog
source: Catalog
vi: Danh mục

# catalogTitle
source: Catalog
vi: Danh mục

source: Add model
vi: Thêm dòng xe

# noModels
source: No models yet.
vi: Chưa có dòng xe.

source: VIN prefixes
vi: Tiền tố VIN

# vinPrefixesHint
source: Use commas or new lines to separate prefixes.
vi: Nhập các tiền tố, phân cách bằng dấu phẩy hoặc xuống dòng.

# vinPrefixesEmpty
source: No VIN prefixes set.
vi: Chưa có tiền tố VIN.

# addCategory
source: Add upgrade item
vi: Thêm hạng mục

# noCategories
source: No upgrade items yet.
vi: Chưa có hạng mục.

source: Warranty (months)
vi: Bảo hành (tháng)

# modelAutoDetected
source: Auto-detected from VIN
vi: Tự nhận biết từ VIN

# modelNotFound
source: Model not found for this VIN
vi: Không tìm thấy dòng xe theo VIN

# selectModelForCategory
source: Select a model to see its upgrade items
vi: Chọn dòng xe để xem hạng mục

# selectCategory
source: Select an upgrade item
vi: Chọn hạng mục nâng cấp

source: Dealer
vi: Đại lý

# selectDealer
source: Select a dealer
vi: Chọn đại lý

source: Add dealer
vi: Thêm đại lý

source: months
vi: tháng

# dealersTitle
source: Dealers
vi: Đại lý

# noDealers
source: No dealers yet.
vi: Chưa có đại lý.

source: Edit dealer
vi: Sửa đại lý

source: Delete dealer
vi: Xóa đại lý

# deleteDealerConfirm
source: Delete this dealer?
vi: Xóa đại lý này?

# dealerInUse
source: Dealer has warranty requests and cannot be deleted.
vi: Đại lý đang có yêu cầu bảo hành, không thể xóa.

source: Edit model
vi: Sửa dòng xe

source: Delete model
vi: Xóa dòng xe

# deleteModelConfirm
source: Delete this model and its upgrade items?
vi: Xóa dòng xe này và các hạng mục nâng cấp?

# editCategory
source: Edit upgrade item
vi: Sửa hạng mục

# deleteCategory
source: Delete upgrade item
vi: Xóa hạng mục

# deleteCategoryConfirm
source: Delete this upgrade item?
vi: Xóa hạng mục này?

# modelInUse
source: Model has warranty requests and cannot be deleted.
vi: Dòng xe đang có yêu cầu bảo hành, không thể xóa.

# categoryInUse
source: Upgrade item has warranty requests and cannot be deleted.
vi: Hạng mục đang có yêu cầu bảo hành, không thể xóa.
